base/InformationRegisters/СостоянияДокументовEDI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияДокументовEDI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказаEDI</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказаEDI</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследнееДействие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияПроцессаЗаказаEDI</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СторонаВыполнившаяДействие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтороныУчастникиСервисаEDI</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УточнениеСостоянияПоДаннымСтороныУчастника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУточнениеСостоянияПоДаннымСтороныУчастника</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТекущегоСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТекущейВерсии</Name>
					<Comment>Номер последней загруженной в прикладной объект версии документа в сервисе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАктуальнойВерсии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПрикладногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХэшТипаДокументаИСтатуса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользовательEDI</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрикладнойОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПрикладнойОбъектEDI</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПрикладногоОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСоответствияПрикладногоОбъектаДокументуEDI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОтправкаДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХэшОтправленногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантУказанияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУказанияНоменклатурыБЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованнаяВерсияПокупателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованнаяВерсияПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяСопоставлениеНоменклатурыПередОтправкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторВСервисе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовEDI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/ТекущиеИтогиПоСтатусамEDI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеИтогиПоСтатусамEDI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказаEDI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовEDI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользовательEDI</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СостояниеСоответствия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСоответствияПрикладногоОбъектаДокументуEDI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/СостоянияДокументовEDI/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.ХэшТипаДокументаИСтатуса = РегистрыСведений.СостоянияДокументовEDI.ХэшТипаДокументаИСтатуса(Запись.ТипДокумента, Запись.ТекущийСтатус);
	КонецЦикла;
	
	Если Не (ДополнительныеСвойства.Свойство("НеВыполнятьРасчетПоСтатусам")
		И ДополнительныеСвойства.НеВыполнятьРасчетПоСтатусам) Тогда
		
		ДополнительныеСвойства.Вставить("ДанныеДляРасчетаИтогаПоСтатусамПередЗаписью", ДанныеДляРасчетаИтогаПоСтатусамПередЗаписью());
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ДанныеДляРасчетаИтогаПоСтатусамПередЗаписью")
		И Не (ДополнительныеСвойства.Свойство("НеВыполнятьРасчетПоСтатусам")
		И ДополнительныеСвойства.НеВыполнятьРасчетПоСтатусам) Тогда
		
		ДанныеДляРасчета = ДанныеДляРасчетаИтоговПоСтатусам(ДополнительныеСвойства.ДанныеДляРасчетаИтогаПоСтатусамПередЗаписью, Отбор);
		
		Если ДанныеДляРасчета.ТребуетсяРасчет Тогда
			
			Если ДополнительныеСвойства.Свойство("ОтложенныйРасчетПоСтатусам")
				И ДополнительныеСвойства.ОтложенныйРасчетПоСтатусам Тогда
				
			Иначе
				
				РегистрыСведений.ТекущиеИтогиПоСтатусамEDI.РассчитатьИтоги(ДанныеДляРасчета.ИдентификаторыДокументов,
				                                                           ДанныеДляРасчета.Статусы, 
				                                                           ДанныеДляРасчета.Менеджеры, 
				                                                           ДанныеДляРасчета.Организации, 
				                                                           ДанныеДляРасчета.СостоянияПрикладногоОбъекта)
				
			КонецЕсли;
			
		КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляРасчетаИтогаПоСтатусамПередЗаписью()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаРегистра.ТекущийСтатус               КАК ТекущийСтатус,
	|	ТаблицаРегистра.ТипДокумента                КАК ТипДокумента,
	|	ТаблицаРегистра.Менеджер                    КАК Менеджер,
	|	ТаблицаРегистра.Организация                 КАК Организация,
	|	ТаблицаРегистра.СостояниеПрикладногоОбъекта КАК СостояниеПрикладногоОбъекта,
	|	1                                           КАК Агрегатор
	|ИЗ
	|	РегистрСведений.СостоянияДокументовEDI      КАК ТаблицаРегистра";
	
	ДополнитьЗапросПоОтборуНабораЗаписей(Запрос, Отбор);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ДополнитьЗапросПоОтборуНабораЗаписей(Запрос, Отбор)
	
	ТекстУсловия = "";
	Счетчик = 1;
	
	Для Каждого ЭлементОтбора Из Отбор Цикл
		
		ИмяПараметра = "П" + Строка(Счетчик);
		
		ТекстУсловия = ТекстУсловия + "
		|" + ?(Счетчик > 1, " И ", "") + "ТаблицаРегистра." + ЭлементОтбора.Имя + " = &" + ИмяПараметра;
		
		Запрос.УстановитьПараметр(ИмяПараметра, ЭлементОтбора.Значение);
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ТекстУсловия) Тогда
		ТекстУсловия = "
		|ГДЕ " + ТекстУсловия; 
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + ТекстУсловия;
	
КонецПроцедуры

Функция ДанныеДляРасчетаИтоговПоСтатусам(ДанныеДляРасчетаПередЗаписью, Отбор)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТребуетсяРасчет",             Ложь);
	СтруктураВозврата.Вставить("ИдентификаторыДокументов",    Неопределено);
	СтруктураВозврата.Вставить("СостоянияПрикладногоОбъекта", Неопределено);
	СтруктураВозврата.Вставить("Статусы",                     Неопределено);
	СтруктураВозврата.Вставить("Организации",                 Неопределено);
	СтруктураВозврата.Вставить("Менеджеры",                   Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПередЗаписью.ТекущийСтатус               КАК ТекущийСтатус,
	|	ПередЗаписью.ТипДокумента                КАК ТипДокумента,
	|	ПередЗаписью.Менеджер                    КАК Менеджер,
	|	ПередЗаписью.Организация                 КАК Организация,
	|	ПередЗаписью.СостояниеПрикладногоОбъекта КАК СостояниеПрикладногоОбъекта,
	|	ПередЗаписью.Агрегатор                   КАК Агрегатор
	|ПОМЕСТИТЬ ПередЗаписью
	|ИЗ
	|	&ПередЗаписью КАК ПередЗаписью
	|
	|;
	|///////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаРегистра.ТекущийСтатус               КАК ТекущийСтатус,
	|	ТаблицаРегистра.ТипДокумента                КАК ТипДокумента,
	|	ТаблицаРегистра.Менеджер                    КАК Менеджер,
	|	ТаблицаРегистра.Организация                 КАК Организация,
	|	ТаблицаРегистра.СостояниеПрикладногоОбъекта КАК СостояниеПрикладногоОбъекта,
	|	-1                                          КАК Агрегатор
	|ПОМЕСТИТЬ ПриЗаписи
	|ИЗ
	|	РегистрСведений.СостоянияДокументовEDI КАК ТаблицаРегистра";
	
	ДополнитьЗапросПоОтборуНабораЗаписей(Запрос, Отбор);
	
	Запрос.Текст = Запрос.Текст + "
	|
	|;
	|///////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПередИПриЗаписи.ТекущийСтатус               КАК ТекущийСтатус,
	|	ПередИПриЗаписи.ТипДокумента                КАК ТипДокумента,
	|	ПередИПриЗаписи.Менеджер                    КАК Менеджер,
	|	ПередИПриЗаписи.Организация                 КАК Организация,
	|	ПередИПриЗаписи.СостояниеПрикладногоОбъекта КАК СостояниеПрикладногоОбъекта,
	|	СУММА(ПередИПриЗаписи.Агрегатор)  КАК Агрегатор
	|ИЗ
	|(ВЫБРАТЬ
	|	ПередЗаписью.ТекущийСтатус               КАК ТекущийСтатус,
	|	ПередЗаписью.ТипДокумента                КАК ТипДокумента,
	|	ПередЗаписью.Менеджер                    КАК Менеджер,
	|	ПередЗаписью.Организация                 КАК Организация,
	|	ПередЗаписью.СостояниеПрикладногоОбъекта КАК СостояниеПрикладногоОбъекта,
	|	ПередЗаписью.Агрегатор                   КАК Агрегатор
	|ИЗ 
	|	ПередЗаписью
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриЗаписи.ТекущийСтатус               КАК ТекущийСтатус,
	|	ПриЗаписи.ТипДокумента                КАК ТипДокумента,
	|	ПриЗаписи.Менеджер                    КАК Менеджер,
	|	ПриЗаписи.Организация                 КАК Организация,
	|	ПриЗаписи.СостояниеПрикладногоОбъекта КАК СостояниеПрикладногоОбъекта,
	|	ПриЗаписи.Агрегатор                   КАК Агрегатор
	|ИЗ
	|	ПриЗаписи) КАК ПередИПриЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ТекущийСтатус,
	|	ТипДокумента,
	|	Менеджер,
	|	Организация,
	|	СостояниеПрикладногоОбъекта
	|ИМЕЮЩИЕ
	|	СУММА(ПередИПриЗаписи.Агрегатор) <> 0 ";
	
	Запрос.УстановитьПараметр("ПередЗаписью", ДанныеДляРасчетаПередЗаписью);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ИдентификаторыДокументов    = Новый Соответствие;
	Статусы                     = Новый Соответствие;
	Менеджеры                   = Новый Соответствие;
	Организации                 = Новый Соответствие;
	СостоянияПрикладногоОбъекта = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		
		ИдентификаторыДокументов.Вставить(Выборка.ТипДокумента);
		Статусы.Вставить(Выборка.ТекущийСтатус);
		Менеджеры.Вставить(Выборка.Менеджер);
		Организации.Вставить(Выборка.Организация);
		СостоянияПрикладногоОбъекта.Вставить(Выборка.СостояниеПрикладногоОбъекта);
		
	КонецЦикла;
	
	СтруктураВозврата.ТребуетсяРасчет = Истина;
	СтруктураВозврата.ИдентификаторыДокументов    = МассивИзСоответствия(ИдентификаторыДокументов);
	СтруктураВозврата.Статусы                     = МассивИзСоответствия(Статусы);
	СтруктураВозврата.Менеджеры                   = МассивИзСоответствия(Менеджеры);
	СтруктураВозврата.Организации                 = МассивИзСоответствия(Организации);
	СтруктураВозврата.СостоянияПрикладногоОбъекта = МассивИзСоответствия(СостоянияПрикладногоОбъекта);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция МассивИзСоответствия(ДанныеСоответствия)
	
	СоздаваемыйМассив = Новый Массив;
		
	Для Каждого КлючИЗначение Из ДанныеСоответствия Цикл
		
		СоздаваемыйМассив.Добавить(КлючИЗначение.Ключ);
		
	КонецЦикла;
	
	Возврат СоздаваемыйМассив;
	
КонецФункции

#КонецОбласти

#КонецЕсли
